{"templateIndex":2,"sharedHashesByProp":{},"data":{"posts":[{"id":1,"date":"1st January 2019","title":"Why another web developer blog?","subtitle":"There is over 7.53 billion people in the world all with individual stories. How many will we know about?","description":"I started web development long before I knew I was to become a web developer, my journey is similar but not \n    the same as everyone else, though we learn the same things we learn them in different ways and its important that we \n    understand this. This blog is more about the nuances in and in between the learning, the experiences and the battles \n    within us.","image":{"src":"https://source.unsplash.com/y-mB90P-6DY","alt":"Sharing experiences as a web developer","caption":"Depending on how you choose to receive it"},"category":"Personal","author":"Orlando Brown","tags":["web developer","blog","journey"],"slug":"why-another-web-developer-blog","component":"./src/posts/why-another-web-developer-blog.js"},{"id":2,"date":"12th January 2019","title":"Challenging your comfort zone","subtitle":"Knowing when to take the training wheels off and really understand how things work.","description":"In this post, I talk about when I started learning React, via the help of CRA, the Create React App \n    CLI tool and how helpful it was to get building and learning react apps, however very quickly it become obvious \n    that I need to learn things like webpack was really working and how to setup everything from scratch","image":{"src":"https://source.unsplash.com/GUSPPE-NjH8","alt":"Challenging you to rise above the fear of the unknown in web development","caption":"RTFM"},"category":"Javascript","author":"Orlando Brown","tags":["create react app","react","webpack"],"component":"./src/posts/challenging-our-comfort-zone.js"},{"id":3,"date":"19th January 2019","title":"To Fullstack or not to Fullstack","subtitle":"Why do we get drawn into these pointless and meaningless definitions and buzzwords?","description":"There is this opinion I hear a lot that you cannot be good at everything, as if you should not try \n  to be good at more than one thing. It is a confusing and potentially debilitating theme, that I personally do not \n  care for. I would like to see more people doing the things they love or would love to do and not allowing others \n  tell them they should do one thing.","image":{"src":"https://source.unsplash.com/F2WX4BTIkpQ","alt":"What do you really want?","caption":"You should define whats important to you."},"category":"Javascript","author":"Orlando Brown","tags":["full stack","javascript","programming"],"slug":"to-fullstack-or-not-to-fullstack","component":"./src/posts/to-fullstack-or-not-to-fullstack.js"}]},"path":"/"}
